Revit 2027 API
ExportPatternTable.GetEnumerator Method
Returns an enumerator that iterates through a collection.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual IEnumerator<KeyValuePair<ExportPatternKey, ExportPatternInfo>> GetEnumerator()
Public Overridable Function GetEnumerator As IEnumerator(Of KeyValuePair(Of ExportPatternKey, ExportPatternInfo))
public:
virtual IEnumerator<KeyValuePair<ExportPatternKey^, ExportPatternInfo^>>^ GetEnumerator()
abstract GetEnumerator : unit -> IEnumerator<KeyValuePair<ExportPatternKey, ExportPatternInfo>>
override GetEnumerator : unit -> IEnumerator<KeyValuePair<ExportPatternKey, ExportPatternInfo>>
Return Value
IEnumerator<KeyValuePair<ExportPatternKey, ExportPatternInfo>>
An IEnumerator object that can be used to iterate through the collection.
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
ExportPatternTable Class
Autodesk.Revit.DB Namespace